Revit 2026 API

# CurveLoopIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Curve Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As Curve
	Get
```
```cpp
public:
virtual property Curve^ Current {
	Curve^ get ();
}
```
```fsharp
abstract Current : Curve with get
override Current : Curve with get
```

#### Property Value

Curve

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

CurveLoopIterator Class

Autodesk.Revit.DB Namespace